{
    "data": [
        {
            "album": "My Beautiful Dark Twisted Fantasy",
            "artist": "Kanye West",
            "review": "My Beautiful Dark Twisted Fantasy is a lot of things: Kanye West’s magnum opus, a work of art, and maybe even one of the greatest rap albums of all time. However, there is one thing it most definitely is not and that is bad.<br />The year is 2009 and Kanye West, after making a fool of himself at the VMA’s and gaining the hatred of what seems like the entire world, locks himself up in a studio in Hawaii and assembles a team. There he works long hard hours, knowing his next project is probably the only thing that could ever redeem him in the eyes of the public. From the fruit of that labor comes My Beautiful Dark Twisted Fantasy, a masterpiece of music – 1 hour 8 mins of what is probably some of the best rap music that will ever be made.<br />This project is probably as close to perfect a piece of art can get. Song after song of incredible music. Bars on top of bars over production that’s so well done it is honestly mind blowing that anyone can make something that well-crafted.<br />This album is Kanye West, the arrogant full-of-himself asshole, being vulnerable and talking about him, his thoughts, and what he’s going through. Take for example Runaway, one of the best rap songs ever made, has Kanye admitting his faults and that outro with him speaking unintelligibly with heavily distorted autotune vocals you can’t hear a word he’s saying but the emotion in his words is raw and it’s real and you can feel it in the music.<br />As for songs I like, basically all of them. Seriously, the run of songs from Dark Fantasy to Runaway is some of the best songs all back to back to back it’s insane how good it is. It’s probably easier to talk about which songs I’m not a big fan of those being only Hell Of A Life and Blame Game, the latter only because of the 2 and a half minute skit at the end of the song, which runs for way too long. That being said these songs aren’t my favorite <em>on the album</em>, they’re still very good just not as good when being compared to the near-perfect songs on this album.<br />Overall, this album is incredible, a work of art that literally everyone should listen to. Even if you’re not a fan of rap or you think Kanye West is a bad person and you don’t like him. Listen to this album, hear it not for the person who made and his endless controversies, but for the art it represents and the countless hours of musical genius that went into creating one of the best pieces of music of this generation. Needless to say, 5 out of 5, if I could give it more I would.",
            "image": "https://i.scdn.co/image/ab67616d0000b273d9194aa18fa4c9362b47464f",
            "spotifyLink": "https://open.spotify.com/album/20r762YmB5HeofjMCiPMLv",
            "appleLink": "https://music.apple.com/us/album/my-beautiful-dark-twisted-fantasy/1440742903",
            "rating": 5,
            "date": "2021-08-22"
        },
        {
            "album": "KIDS SEE GHOSTS",
            "artist": "KIDS SEE GHOSTS",
            "review": "The dynamic duo of Kanye West and Kid Cudi come together to bring us an entire project and they definitely do not disappoint.<br />KIDS SEE GHOSTS has two greats of our generation coming together and they seem to jump on each track just to flex their combined creative genius. Seven tracks, some a little experimental, but all very great and easy to listen to. These tracks come together to make a pretty short album, but one that’s easy to get into as well as one that keeps you engaged and never disappoints.<br />I distinctly remember my first time listening to the project together with my friends in high school together in one of their cars and the whole thing was incredible front to back. It’s stayed with me for years now and still I can listen to the whole thing, sing it almost all word for word, and enjoy every second of it.<br />Highlight songs for me include the title track Kids See Ghosts, Feel The Love, and Cudi Montage all great songs that always have a spot in my playlist. Only one song doesn’t really do it as good for me as the rest and that’s Freeee, I don’t think it’s a bad song but it’s definitely not as good as Ghost Town (the song it’s supposed to be a sequel of) or as other tracks on the album.<br />Overall, needless to say, this gets a full 5 stars, the only complaint I can even come up with for the album is that it should’ve been longer. With a runtime of only around 24 min it leaves you wanting more and hopefully we can see some more in the near future. If you’ve never heard KIDS SEE GHOSTS I definitely recommend you check it out, I’m positive you won’t be disappointed, especially if you’re a Kanye or Cudi fan.",
            "image": "https://i.scdn.co/image/ab67616d0000b273013c00ee367dd85396f79c82",
            "spotifyLink": "https://open.spotify.com/album/6pwuKxMUkNg673KETsXPUV",
            "appleLink": "https://music.apple.com/us/album/kids-see-ghosts/1396710872",
            "rating": 5,
            "date": "2021-08-22"
        },
        {
            "album": "JEFFERY",
            "artist": "Young Thug",
            "review": "As an artist Young Thug is pretty interesting, I wouldn’t call his music the highest of art, but at the same time it doesn’t really feel like that’s what he’s going for. Listening to the music it feels like Young Thug gets behind the mic and just has a good time with it, and for me that makes listening to his music a good time as well.<br />JEFFERY is probably the first Young Thug project I ever listened to in full. The album or EP seems to be a 10-track ode to all of his inspirations. Each track is named after a different person who I assume are his inspirations, with the exception of Pick Up The Phone which seems to be an odd one out as well as Harambe who is most likely just there as a joke.<br />Overall the project is actually pretty well done. It’s definitely one of my favorite Young Thug projects to date. It’s full of the classic Young Thug bars, where they’re either completely unintelligible or so strange you question whether, and maybe hope, you misheard it. Either way if you wish to know what he’s talking about you’re going to need the genius page for each song. But the good part is that you don’t need the lyrics to enjoy the vibe and the music of each song. Young Thug’s voice is like an instrument, there just to enhance the listening experience, not there to provide commentary or insight into whatever topic he’s talking about.<br />The best songs on the album are definitely Wyclef Jean, which is probably my favorite Young Thug track ever, as well as Kanye West and Pick Up The Phone, which all go pretty hard in their own right. My least favorite is probably Floyd Mayweather, which in my opinion is a little too long and kind of a lot slower than all the other songs, it’s definitely a different vibe and I can’t say I’m all there for it.<br />In conclusion, the album is great, and I love it, I think it’s some top-level Young Thug and if you’re a fan of that kind of music you should definitely give this album a try. As for a rating, I’m going to go with a 4 out of 5, incredibly done and a great listen.",
            "image": "https://i.scdn.co/image/ab67616d0000b273d0c72291cd96834e199e1ff8",
            "spotifyLink": "https://open.spotify.com/album/7EpUpNUkkEGnaCvkcn1j4H",
            "appleLink": "https://music.apple.com/us/album/jeffery/1146718343",
            "rating": 4,
            "date": "2021-08-22"
        },
        {
            "album": "ye",
            "artist": "Kanye West",
            "review": "ye, the 8th studio album by Kanye West, is a short one, only clocking in at around 24mins but it’s also a pretty heavy one. This album sees Kanye in a rare fragile and honest place. This makes for music that’s probably a little more conscious and meaningful than his other work but still very much Kanye West music.<br />On this album we see Kanye opening up about a lot of things he’s never really talked about publicly, at least not in his music. He talks about suicide, problems in his marriage and getting through those problems (that didn’t age very well), as well as his bipolar disorder, and the dilemma he faces trying to raise a young daughter while being a huge part of a rap game that rarely shows respect to women. It makes for a project that at least seems like an honest look into the person who is Kanye West and his tumultuous mind.<br />With all that being said we still see some weird and questionable lyrics that honestly he probably shouldn’t have said. If we go back to 2018 when Kanye released this he was in a pretty weird place and it seems to jump out in some of the lyrics he chooses to say on the project. He references his very questionable take on slavery in Wouldn’t Leave and instead of trying to walk it back he seems to defend it which is at least a little weird. We also get some of the usual suspect lyrics that are pretty bad but actually kind of funny like the focus on two things at once line in All Mine. Overall lyrics aren’t too bad, they take you out of it at some points but honestly it comes with the territory, this is Kanye West we’re talking about.<br />As for songs on the album I think Ghost Town is by far the best, it’s a great song and if you’ve never heard it I think you should I really love it. As for songs I don’t really like for one I Thought About Killing You, I don’t really think this is a bad song but it’s a really weird one and it’s hard to get into it since it only really starts after 2 mins since the first 2 mins is Kanye talking about his suicidal thoughts and killing you. I also don’t really like Wouldn’t Leave very much, it’s super slow, has the weird lyrics I mentioned before and is just all around far from the best Kanye has to offer.<br />This album is an interesting one, it’s really short so it’s easy to listen to and isn’t much of a commitment but that also means it’s kind of lacking in content which makes the weak parts so much more impactful to the experience. For example since the album is only 24 mins, that 2 min intro for I Thought About Killing You is over 8% of the total runtime, that’s kind of crazy and it definitely takes a toll on the experience. I also find this project is kind of forgettable, sometimes I forget this album ever came out and I think that’s because of its short runtime as well as it’s just good, nothing more. Usually, Kanye projects are innovating or huge events or have the strangest album rollout possible but this is so average in comparison. It came out on time, it didn’t really completely miss expectations, and it didn’t do anything new.<br />Overall, I don’t think this album is bad, I think it’s actually pretty good but it’s just that, good. It doesn’t blow me away and it doesn’t really do anything exceptional it’s just a solid collection of songs. For that reason, it gets a 3 from me. As for whether I recommend, I think if you’re a fan of Kanye, definitely give it a listen, it’s still Kanye music and it’s not bad. If you’re not a fan of Kanye, just pick a different project to start out with, there are many better ones. That being said I think Ghost Town should be something everyone listens to regardless, seriously that song is great.",
            "image": "https://i.scdn.co/image/ab67616d0000b2730cd942c1a864afa4e92d04f2",
            "spotifyLink": "https://open.spotify.com/album/2Ek1q2haOnxVqhvVKqMvJe",
            "appleLink": "https://music.apple.com/us/album/ye/1441456689",
            "rating": 3,
            "date": "2021-08-22"
        },
        {
            "album": "The College Dropout",
            "artist": "Kanye West",
            "review": "Kanye West’s first album is a very strong introduction to the rap game. The album is absolutely packed with great song after great song. Each having Kanye’s infectious beats and the classic soul samples that everyone fell in love with. It comes together to make a wonderful album that’s enjoyable from beginning to end.<br />This album is actually pretty impressive, it’s incredibly good, especially for an artists first real project. It also comes together to tell a pretty funny and enjoyable story with funny skits spread throughout the album and a general theme through the songs. This theme obviously being school, specifically post-secondary education, as well as full-time jobs and Kanye’s general dislike for all of it. That being said, the theme is pretty sparse in the songs and isn’t even present in most of them so even if you can’t get behind the sentiment of the album there are plenty of songs on it that have nothing to do with that theme.<br />As for good songs on the album, there are the definite greats like All Falls Down and Jesus Walks, but I think most people can agree those are incredible, so I’ll focus on less-mentioned songs that I really like. Those being Spaceship and Never Let Me Down, both being excellent songs in my opinion. Never Let Me Down is amazing, it has a beautiful sample present through the entire song and a wonderful chorus. Each of the 3 rappers present come to deliver a great verse each and it all comes together to make a song that I feel is a testament to how great Kanye was in this era of his career. As for Spaceship, that’s more of a song I just love for the vibe. I think this song has more of the theme of the album present, but what really gets me is the infectious hook sung by Kanye with another great sample behind it.<br />In terms of songs I don’t like, there aren’t really many, I think all of the songs are pretty good. The only ones I can’t say really connect with me are Get Em High and Last Call. Get Em High just isn’t really the kind of song I vibe with so I have some trouble enjoying it much. As for Last Call, I don’t think it’s terrible but it’s pretty hard to enjoy, especially on multiple listens. The problem for me is that it’s 4 mins of a pretty cool song I guess but it’s followed by quite literally 8 full mins of Kanye just talking about how he got started in the music industry. Now don’t get me wrong it’s interesting to hear his story but only on the first listen, every time after that it’s just 8 mins of talking that you already heard before.<br />Overall, I think The College Dropout is wonderful, it’s a great album with so much going for it and it really makes me understand some of the fans who miss this Kanye era. It definitely was a great time in his career, and the music he made at this time was so good and also free from the controversy he seems to be constantly surrounded by nowadays. If you’ve never heard Kanye this is a great place to start and if you have heard Kanye but never listened to this album, then seriously get on it, it’s some of his best work. Five out of five stars for sure.",
            "image": "https://i.scdn.co/image/ab67616d0000b27325b055377757b3cdd6f26b78",
            "spotifyLink": "https://open.spotify.com/album/4Uv86qWpGTxf7fU7lG5X6F",
            "appleLink": "https://music.apple.com/us/album/the-college-dropout/1412872568",
            "rating": 5,
            "date": "2021-08-23"
        },
        {
            "album": "Late Registration",
            "artist": "Kanye West",
            "review": "The second album from Kanye West builds a bit on the first one with similar themes of school except with the addition of being broke and in college which is what most of the skits are based on. The skits are still just as funny and are spread through the album pretty nicely.<br />It’s hard not to compare Late Registration with The College Dropout and I have to say that I do think Late Registration is a little weaker but that’s most likely just my personal opinion. I find the jazz inspired samples and production just doesn’t hit as hard for me as the soul in The College Dropout. That isn’t to say Late Registration is bad, I think it’s quite good and it has its fair share of highs, I just feel it’s not as consistently high as the previous album. In particular I find the album has a pretty weak mid-section, I think from Skit #1 to Skit #2 there aren’t really many highlight songs unfortunately. I think it does pick up after that but that period definitely affects my enjoyment of the album.<br />As for songs I like, there are actually quite a bit, to start with are the givens like Gold Digger and Touch The Sky which I think everyone can agree are very good. Other than those, I really love Diamonds From Sierra Leone, either the remix or the original, I just really love the storytelling on this song. Also, that beat and the sample are incredible and it makes for such an amazing song to listen to. Another song I really love is Hey Mama, it’s an emotional tribute to Kanye’s mother and it’s beautiful. It really makes clear how important Kanye’s mother is to him and listening to it now hurts a bit knowing the unfortunate fate of Donda West.<br />In terms of songs I’m not a fan of, both Drive Slow and Crack Music aren’t really my type of song. I think both are not very fantastic, they don’t jump out at me as being special or unique songs on the album and I can’t vibe as well with these as I can with most of the other songs on the album. I also think both maybe have a little too much runtime and that probably adds to my distaste for them as they kind of just go on for too long.<br />Overall, I think Late Registration is a good album in Kanye’s discography, but it’s just a good album. I think a few other records in Kanye’s discography separate themselves from Late Registration and truly are greats. That being said, Late Registration is a great record and there are some serious gems in the track list, so if you’ve never heard it and you enjoy some of Kanye’s music definitely check it out, I’m sure you’ll find something to love about it. I’ll give this album a 4, a great project but not a perfect one.",
            "image": "https://i.scdn.co/image/ab67616d0000b273428d2255141c2119409a31b2",
            "spotifyLink": "https://open.spotify.com/album/5ll74bqtkcXlKE7wwkMq4g",
            "appleLink": "https://music.apple.com/us/album/late-registration/1440668749",
            "rating": 4,
            "date": "2021-08-23"
        },
        {
            "album": "Graduation",
            "artist": "Kanye West",
            "review": "To me Graduation feels like a celebration album that Kanye West made to celebrate the success of his first two projects. The direction seems to have gone in a much more celebratory and happy tone as the music is much more upbeat than previous records. I think I’ve either heard or read somewhere that the purpose of Graduation was to have a bunch of stadium songs Kanye could play at concerts to hype up the crowd. Either way, that’s exactly how the album comes across, a bunch of hype songs that would sound great at a party/club/concert.<br />Not only is the album pretty hype it’s also quite good. For a style of music Kanye’s never really done before Graduation is done impressively well. Most of the songs are bangers that are super enjoyable, with infectious beats. Probably best of all though, despite each song being made with a specific hype sound in mind, every song is different and unique enough that they each stand out in their own right. This makes listening to the album enjoyable and it doesn’t get repetitive or boring because every song is a generic hype track. They’re all hype but they’re each far from generic.<br />The first half of this album is actually incredible. From the incredible opener that is Good Morning, all the way to Can’t Tell Me Nothing is just great track after great track. Included in that group is Stronger, probably one of Kanye’s most popular songs of all time, and for good reason, that song is incredible and the daft punk feature/sample is so good. We also have I Wonder another favorite of mine as it’s just such a wonderful and infectious song that just always has me singing along. As for tracks outside of those 6, Homecoming is incredible. That song has such a great beat and the chorus sung by Chris Martin is so damn infectious I cannot help but sing along every time I hear it.<br />Now where the first half is super good, the second takes a severe dip in enjoyability for me. That isn’t to say it’s free of good songs, again as I said earlier Homecoming is incredible and most of the other songs are decent. The only two songs I really have a problem with are Barry Bonds and Drunk and Hot Girls. For some reason, both just really miss the mark for me, and I can’t enjoy it. It reaches the point where the two back-to-back almost ruin the high I get from the first 6 tracks. I think my main issue with Barry Bonds is how slow and off-theme it is. It feels like most of the other songs are made with hype in mind but for some reason Barry Bonds is this slow, chill track which just doesn’t fit in my opinion. I think Drunk and Hot Girls has a similar problem to Barry Bonds where it just kind of ruins the theme of the album so far and it’s so slow and chill whereas songs like Good Life and Can’t Tell Me Nothing are so hype in comparison. It makes for a terrible contrast that just takes me out of the album a bit and I can’t enjoy it.<br />Overall, I think this album is really good. For the most part, it sticks to it’s hype theme pretty closely and the tracks are all really well done, to the point where I can imagine most being great openers for a concert. It definitely has its problems and its weak parts but for me the strong parts are so strong that it makes up for the weak parts and some more. Like most other Kanye records, if you’re a Kanye fan check this out. If you’re not a Kanye fan, maybe try this if you’ve never heard it, it’s a unique vibe and there’s some seriously good tracks on the album. Graduation gets a 4 out of 5.",
            "image": "https://i.scdn.co/image/ab67616d0000b2739bbd79106e510d13a9a5ec33",
            "spotifyLink": "https://open.spotify.com/album/5fPglEDz9YEwRgbLRvhCZy",
            "appleLink": "https://music.apple.com/us/album/graduation/1451142304",
            "rating": 4,
            "date": "2021-08-23"
        },
        {
            "album": "808s & Heartbreak",
            "artist": "Kanye West",
            "review": "Kanye’s 4th studio album, 808s & Heartbreak is a very unique one. Described very well by its title, we see Kanye air out his hurt, pain, and heartbreak using autotune over well-produced beats dominated by heavy-hitting 808s. The album was made shortly after Kanye lost his mother Donda and broke up with his then fiancée. The hurt from these two terrible losses really comes out through the course of the album. It makes for a very emotional album with a unique sound, at least for the time, that is a great listen.<br />It’s hard to talk about 808s & Heartbreak without at least mentioning its influence in modern rap. With 808s & Heartbreak Kanye created a whole new subgenre of rap that would bring so much new talent to rap and inspire an entire generation. Even if we try to downplay the impact and say Kanye didn’t create it and instead T-Pain or Kid Cudi created it, it’s impossible not to acknowledge how much power and impact Kanye’s record had in popularizing the genre and inspiring so many. That being said I don’t want this review to be a history lesson of rap, the influence of 808s & Heartbreak is undeniable, but I don’t want my review to be only about its influence, I want it to be about the music.<br />The music on 808s & Heartbreak is great, there’s a reason why this album inspired an entire generation of new musicians. It’s definitely incredible music. Personally, I prefer the first half of the album as I think it has a lot more songs I like and the ones I’m not too much of a fan of aren’t too bad. The second half, I feel doesn’t have as many hard hits as the first and some of the songs I just don’t really like much.<br />My favorite songs on the project are Heartless, Welcome to Heartbreak, and Love Lockdown. I think Heartless is pretty self-explanatory, it’s an incredible song. I remember listening to it all the time as a kid on my mp3 player and it’s just such a good song. Welcome to Heartbreak is a great Kanye and Cudi collab which serves as a great opener to the project and has some great lyrics that really set the tone of the project and the subject matter of the music. Love Lockdown is just such a jammer. The chorus is so great, always having me singing along, and the beat never fails to get my head bouncing like I’m a bobblehead. It’s just so infectious and a wonderful listen.<br />My least favorite songs on the album would probably be Bad News and See You In My Nightmares. I just think these two songs aren’t as catchy or infectious as the better songs on the album. I also don’t exactly think they’re terrible, they just don’t reach the same level that the better songs on the album do, at least not for me. I’m also not really a fan of Pinocchio Story, I understand the sentiments of live performance pieces on albums but for the most part I’m not exactly a fan of them. My biggest problem is they take me out of the album a little as it feels kind of like I’m listening to a leaked version of a song or a YouTube clip. I also feel like it’s some wasted potential, Pinocchio Story sounds like a very emotionally charged and heavy song that would probably be a beautiful closer if it was just over a beat and recorded in a studio. Instead, the emotion is drowned out by the echo’s and screaming fans that come with a live performance.<br />Overall, I think 808s & Heartbreak is a great album and a beautiful part of Kanye’s story and his discography. Its influence is incredible and the modern music it inspired is some of my favorite music ever. That being said I only want to review based on the music so it will get a 4, if I took into account the influence it’s an easy 5, but I don’t want to do that. If you’ve never heard 808s & Heartbreak you should listen to it, if not for its great music, then definitely for its incredible influence on modern music.",
            "image": "https://i.scdn.co/image/ab67616d0000b273346d77e155d854735410ed18",
            "spotifyLink": "https://open.spotify.com/album/3WFTGIO6E3Xh4paEOBY9OU",
            "appleLink": "https://music.apple.com/us/album/808s-heartbreak/1441410287",
            "rating": 4,
            "date": "2021-08-23"
        },
        {
            "album": "Yeezus",
            "artist": "Kanye West",
            "review": "Yeezus is an industrial, gritty-sounding album that shows a much a side of Kanye with a much larger ego. The songs are rough with heavy hitting base and, in general a much grittier sound than much of his earlier songs. That isn’t to say he ditches his past music style, there are still plenty of samples and a lot of songs have parts where Kanye brings back the beautiful sounds he’s known for.<br />The lyrical content of the album is also very egotistical and grimy. He has an entire song talking about how he’s a god. As a stark contrast from his previous two albums, instead of introspection, sadness, and disappointment his lyrics are violent, seemingly filled with anger, talking about everything from relationships to his impact in the industry.<br />That being said, even though Yeezus is grimy, egotistic, and rough sounding, it’s a great album. It’s a lot more experimental sounding than his previous works and because of that, a lot harder to get into. The industrial music is a much different sound than most are used to, despite other musical acts doing it even before Yeezus, like Death Grips. However, once you do get into that sound of music, it’s hard not to love Yeezus and all the grimy sounding tracks that fill its track list.<br />I have quite a few songs I love on this album, however, for the sake of not writing too much, I’ll narrow it down to two for the review. Those two would have to be New Slaves and Hold My Liquor. New slaves has an incredible beat, with hard-hitting vocals over the entire thing, Kanye talks about life as a black man in America, and in particular his experience getting into the fashion industry. Then there’s the outro, a beautiful experience, with vocals by both Kanye and Frank Ocean, it leaves you floating as the song ends. As for Hold My Liquor, this is a song I love for both the beat as well as Kanye’s flow in the first half. I’ve also always loved the intro to this with the vocals over the beat without any bass. This also has a great guitar outro that is a great closer to an amazing song.<br />In terms of songs I don’t really like, it would have to be Guilt Trip and Send It Up. I don’t think either of these songs are really bad, I just don’t like them compared to all the better tracks on the album. Guilt Trip, I enjoy the chorus and the Kid Cudi bridge, but I’m not a fan of the verse. I also don’t really like the beat for the song. For Send It Up, I also have some issues with the beat, I don’t like it much, I think it’s pretty par for the course for the album, but most other songs have breaks where the violent beat of the song is broken up by a beautiful break somewhere and I think this contrast is an important part of enjoying the album. Something like On Sight which has a beautiful, almost hymn-like interlude halfway through the song, which breaks up arguably the most violent sounding beat on the entire project. I’d go as far to say On Sight is only good because of that interlude breaking up the song like it does. I think Send It Up would sound a lot better if it also had something that breaks up the violence of the beat.<br />Overall, this project is really solid and personally, I like it a lot. I think there is some room for improvement, and it could have been a better project, which is why I will give it a 4. I think this is probably not a good starting album if you want to listen to Kanye, not because it’s bad but because it’s so different. The project is violent, experimental, and industrial. It’s far from an introductory project so if you do want to listen to Kanye, I recommend starting somewhere else, and then you can come back to this project once you’re more versed in his catalog and maybe rap as a genre.",
            "image": "https://i.scdn.co/image/ab67616d0000b2731dacfbc31cc873d132958af9",
            "spotifyLink": "https://open.spotify.com/album/7D2NdGvBHIavgLhmcwhluK",
            "appleLink": "https://music.apple.com/us/album/yeezus/1440873068",
            "rating": 4,
            "date": "2021-08-24"
        },
        {
            "album": "The Life Pablo",
            "artist": "Kanye West",
            "review": "On release The Life of Pablo was a very different album than what it is now. Its rollout was a very strange one, on release the songs were okay but some were a bit unfinished and there was a whole song missing compared to what we have now. Since the album is in the state it is now my review will be focused on this most recent version and not the older ones that existed on release.<br />The Life of Pablo has a special place in my heart, it was one of the first Kanye albums I ever heard, and I’d say it’s one of the albums that got me into rap music as a genre. The album is great, a collection of wonderful tracks with lyrics that have Kanye celebrating his success in both music and fashion and production that is as good as is expected from Kanye. Kanye strokes his ego even more than usual with songs like Famous and Facts where he celebrates his fame and influence as well as his Yeezy brand. The album also has a couple funny and strange lines like the classic asshole one in Father Stretch My Hands Pt.1. They mostly pull laughs from me and don’t have me questioning why Kanye would ever say that so they don’t really hurt the experience much.<br />My favorite tracks on the album are honestly really hard to narrow down to a couple. I love so many of the tracks on this album and I come back to listen to certain ones all the time because they’re all just so memorable. If I had to pick one song on this album that is the absolute peak of Pablo for me, it would have to be Saint Pablo. Saint Pablo is the 20th track on the album and was added post-release. The song is incredible and ends off the album in such an amazing way. Kanye flow and rapping on this track is some of the best in a long time. He talks a lot about money, controversies, and a lot more personal topics. It’s a much more lyrically involved track then most of the other songs on the album and it has some great production with some incredible interludes and a great outro that always has me floating.<br />As for songs I’m not a fan of, it’s honestly hard to find one, I think every song has a little something and I can enjoy almost all of them every time I listen to the album. I think probably the weakest tracks on the album would have to be Low Lights and Pt. 2. Low Lights is basically an interlude with no vocals by Kanye on it at all. Also, it has a very simple introduction at least compared to most other Kanye songs. As for Pt. 2, don’t get me wrong, I actually really like this song and it’s never a skip on the album. The only reason I think it’s a little weak on the album is because it’s literally just a Panda remix. It kind of just makes me question why is this even on the album when it could be like a single or something. It’s not a bad song but its inclusion on the album is a little strange to me, I just assume Kanye got a little obsessed with the song and so forced onto the album even if it’s a bit strange.<br />Overall, I love this album so much, as I said earlier it has a special place on my heart. I think every song is enjoyable and there are no skips from beginning to end of the album. If you’ve never heard The Life Of Pablo, please listen to it. It’s some of Kanye’s best work in my opinion and it can’t be missed, especially if you’re a rap fan. This definitely gets a 5 from me.",
            "image": "https://i.scdn.co/image/ab67616d0000b2732a7db835b912dc5014bd37f4",
            "spotifyLink": "https://open.spotify.com/album/7gsWAHLeT0w7es6FofOXk1",
            "appleLink": "https://music.apple.com/us/album/the-life-of-pablo/1443063578",
            "rating": 5,
            "date": "2021-08-24"
        },
        {
            "album": "JESUS IS KING",
            "artist": "Kanye West",
            "review": "A lot of people have a lot of opinions about JESUS IS KING, and most of them aren’t very good. I guess I’ll start by saying I don’t think the album is bad, it’s pretty good, but it’s definitely not up to par with most Kanye projects. I was fortunate enough not to follow too closely with the Yandhi era of Kanye so I was never too disappointed with Yandhi becoming this album. That all being said, there’s definitely a theme throughout this album for me and that is that it feels just a little bit unfinished.<br />There are some great songs in this album, songs that feel complete and sound up to par with other Kanye songs. That being said, I can’t say the same for every track. Some of these tracks feel, to me, like they would have and probably should have been completely different if Kanye put a little more time behind making the album. As an example, I’ll use the song Follow God. Now, I think Follow God is good, it’s Kanye flexing some of his rap prowess and the beat is pretty banging. That being said, the song is not even 2 mins long. It feels like Kanye had an entire song, took out one single verse and then that became Follow God. When I hear this song, I like it, but also, I just wonder like “where is the rest of the song”. This isn’t specific to that one song either, songs like Every Hour and Jesus Is Lord would sound so much better if there was more song around them and it wasn’t just basically an interlude. Songs like Selah, and Everything We Need aren’t bad, but it feels like there’s a verse or an outro that definitely should be there, but it isn’t. Now I understand it’s very possible that Every Hour and Jesus Is Lord we’re meant to be these short interlude-like tracks but regardless I’ll stand by my opinion that I think it would sound better if there was more to them.<br />Now for songs I like, definitely On God and Use This Gospel. On God is a great track with some incredible production by Pierre Bourne. It’s got this great sound to it and Kanye really has some good rapping on this track. Every time I hear it, I’m drawn to singing along and I enjoy every second for sure. As for Use This Gospel, I genuinely think this is the best song on the album by far. Now if you care for the history of it this was a Yandhi song called Law of Attraction and I don’t think what it became is disappointing in any way. The beat is great, with the humming on top of some piano keys. Probably my favorite part of the song though is the Clipse parts. They come on and absolutely kill it with a great verse that adds so much to the song and is one of my favorite parts on the whole album.<br />As for songs I dislike, I mentioned earlier a lot of the songs I think should have had some more work done to them, but funny enough I don’t think those are the bad tracks on the album at all. They just feel unfinished, but the part that is finished is really good. Therefore, the songs I’ll say I wasn’t impressed with are Water and Hands On. For Water, there’s really just nothing impressive about it, the production is simple, especially for Kanye standards and I don’t really like Kanye’s flow on it either. The chorus and bridges aren’t too bad, but a song is more than just those parts and the verse just doesn’t do it for me at all. As for Hands On, it’s a lot of the same as with Water, the production is nothing to write home about and Kanye’s verse is also just not very good in my opinion. There’s also a super weird part near the end where I think Young Thug comes on and says like 5 unintelligible words. It literally sounds like what he said was a recording of a phone call with bad connection, it makes me think there’s a missing feature that would have been there given more time, which is obviously disappointing.<br />Overall, JESUS IS KING isn’t a terrible album, I enjoy listening to it and it’s pretty easy to get through especially since it’s only 27 mins and most of the songs are pretty good. I guess my biggest problem is that it’s so disappointing considering how unfinished it sounds and how much better it could have been if it was properly finished. For these reasons I don’t recommend listening to this unless you’re seriously a fan of either gospel music or rap or, preferably, both. This gets a 3 from me.",
            "image": "https://i.scdn.co/image/ab67616d0000b2731bb797bbfe2480650b6c2964",
            "spotifyLink": "https://open.spotify.com/album/0FgZKfoU2Br5sHOfvZKTI9",
            "appleLink": "https://music.apple.com/us/album/jesus-is-king/1484936940",
            "rating": 3,
            "date": "2021-08-24"
        },
        {
            "album": "section.80",
            "artist": "Kendrick Lamar",
            "review": "Section.80 is the debut studio album from what I think is one of the greatest rappers of this generation, and maybe one of the greatest rappers of all time. The album seems to focus on the story of a couple girls (Tammy and Keisha) and the struggles they go through especially with relationships. I also feel like this album focuses a lot on telling stories from a generation of kids growing up in the crack epidemic of the 80s. With songs like A.D.H.D and Ronald Reagan Era referencing the issues directly.<br />In this album, Kendrick is pretty new to the music industry, and it seems like he’s really finding his place and his sound. That being said, it’s a pretty impressive first album, filled with great music and meaningful tracks. Kendrick also touches on a lot of different topics over the course of the album. It seems like they mostly focus on life in the streets and the struggle that involves but he doesn’t really focus on his own stories but instead chooses to tell general tales that are common in that environment. I think a lot of the songs hit pretty hard and the meaning is really impactful. One that stands out to me is Keisha’s Song, a sad story about the life of a prostitute on the street.<br />As for songs on this album, I think most of them are good, but the one’s that stand out to me are Keisha’s Song, Rigamortus, and HiiiPower. Keisha’s Song, I mentioned earlier, is a very good show of Kendrick’s storytelling. It tells the sad story of a prostitute on the street. I also really like the production and beat on the track, especially the chorus, which I think is very fitting for the mood and topics of the track. Rigamortus is a short song where Kendrick really flexes his lyrical ability and flow. I love the beat on this track, with the trumpets at first and then nice drums coming in later. It reminds me a little of the jazz inspired beats that will make up the majority of his tracks on To Pimp A Butterfly. As for HiiiPower, I really like this song as the closing song on the album. The album focuses a lot on the struggles and tribulations of black people in America. HiiiPower is a bit of a contrast to that, or rather a beacon of hope in the darkness. He talks about black power, and black excellence, referencing many revolutionaries and black panther members throughout the song. As the song goes on, he talks about getting off the slave ships and building the pyramids. I just think this song is about the power that black people in America hold, whereas the rest of the album is about the struggle they face, and I think that’s a fitting end to an album like Section.80.<br />Now for songs I didn’t like as much I would probably only really say Blow My High. I just don’t really like the very slow beat and flow over the track. I think it’s just a little slow for my taste. I don’t think it’s bad, I’m just not a fan of the slowness of it all, I still think it’s a pretty well-done song, I’m just not a big fan of the vibe.<br />Overall, Section.80 is a great first album for Kendrick, but it’s definitely not his best. I think it’s some great conscious rap, with interesting topics and a pretty good message but I think the individual tracks don’t hit as hard on their own as they could. I will give this a 4 out of 5, I think it’s really well done and there are some great songs, but I don’t think it’s anything super special or unique. If you’re a fan of rap or Kendrick, then this is definitely an album you should listen to. If not, Kendrick has other albums that I think are incredibly good and probably a better introduction to rap and Kendrick as a whole.",
            "image": "https://i.scdn.co/image/ab67616d0000b273eddb2639b74ac6c202032ebe",
            "spotifyLink": "https://open.spotify.com/album/1bkN9nIkkCnXeG4yitVS1J",
            "appleLink": "https://music.apple.com/ca/album/section-80/1475039105",
            "rating": 4,
            "date": "2021-08-25"
        },
        {
            "album": "good kid, m.A.A.d city",
            "artist": "Kendrick Lamar",
            "review": "good kid, m.A.A.d city is the second studio album from Kendrick Lamar, it is also really hard to type so I’ll refer to it as GKMC from now on. GKMC is incredible, 12 great songs that each sound great in their own right but come together to make an incredible story. GKMC seems to be Kendrick talking about the street life, not necessarily his experience in particular but the general experience someone like him might face.<br />I don’t usually talk about or care much about storytelling in albums, but for me GKMC does it so well that I can’t help but talk about it. The story is very reminiscent of the album title, the story of a good kid in a mad city. The character we follow (which is Kendrick) starts off just wanting to get laid but gets set up by the girl and is jumped. Him and his friends go to get revenge and in a shootout one of the friends is hit and dies. Looking for revenge, the group meets an old lady who teaches them better and helps them find God instead of continuing the cycle of violence. However, what I think is the best part of this story, is the order in which it’s told. The first song on the album starts telling the story just slightly after the story starts chronologically. The last song (the 12th) on the album is the first chronologically. To me this seems to suggest this story of the good kid who suffers in the mad city is one that’s constant, a story that happens again and again. It also suggests to me that the story we hear during the album is Kendricks and the one that starts at the end of the album is another kid just like Kendrick. If the story doesn’t go the same, if the woman who saved Kendrick and his friends from the life of violence, doesn’t save this new kid, his life may not be so fortunate, and he may be stuck in the cycle of violence. I think this story is an excellent one, and honestly, it’s a big part of enjoying this album for me as a story this rich is quite rare to me.<br />Songs I like on the album are literally almost all of them. I think every song is very good in its own right and it’s hard to pick just a few to talk about as my favorite. If I had to choose, I would say Money Trees, and Sing About Me, I’m Dying of Thirst. Money Trees is just a great jam for me. It’s got a great beat and I think it also has a pretty good message. It’s also a little less serious than most of the other songs on the album, especially considering the subject matter. I just think it makes for a great song to jam out to that stands out on an album filled with great songs. Sing About Me, I’m Dying of Thirst is a highlight for me for a very different reason. This song which comes in towards the end of the album is the song where Kendrick and his friends meet the woman who saves them from the life of violence. This song is a storytelling masterpiece. In the first half, Kendrick talks from the perspective of multiple people, one from the brother of Kendricks dead friend, one from the sister of a girl mentioned in a song off section.80, and one from the perspective of Kendrick himself. The first verse is the brother thanking Kendrick for the love he showed the dead brother. He also struggles and suffers with the feelings of revenge and hates these feelings. He wants Kendrick to tell his story and his verse is interrupted by gunshots, suggesting he died before the song ever came out. The second verse has Keisha’s sister (from section.80) criticizing Kendrick for the words he said about Keisha on section.80. She tells him that his words mean nothing and won’t help her unless those words are helping her sell her body. Lastly, we have Kendrick, talking about death and his close relationship with it and then replying to the two previous verses. He finishes his verse by asking the questions “Am I worth it? Did I put enough work in?” Finally, the song enters it’s second part “Dying of Thirst”. Here Kendrick talks about the thirst of the soul, the thirst caused by sin. The song finishes with the skit where Kendrick and his friends are saved from the life of violence by the woman. It all comes together to be 12 mins of powerful storytelling and some of the most beautiful music ever and probably my favorite Kendrick song of all time.<br />In terms of songs I didn’t like, there aren’t any. However, I do want to mention the Bitch, Don’t Kill My Vibe Remix on the album. I don’t think this song is bad, but I think it’s a weird addition. As the 13th track on the album, this comes after the end of the story where the story resets and the next good kid goes out to face the mad city. In my opinion, this makes for an awkward listen since the story ends but one more song plays. I think this probably should have just been left for the deluxe version of the album. In fact, on the deluxe album, this song as well as all the others added are on the second disk, whereas the first disk just has the first 12 songs where the story is being told. This seems to mean even Kendrick, or the record label, or whoever compiles the album, agrees that this remix should be listened to in a different context than the main body of the album.<br />Overall, this album is seriously one of the best albums of this generation. Song after song is incredibly made and they all come together to tell one of the best stories I’ve ever seen told in music. This is definitely a 5 out of 5 for me. If you’ve never heard this album, please give it a listen. You won’t be disappointed, this is seriously one of the greatest albums of all time.",
            "image": "https://i.scdn.co/image/ab67616d0000b273d28d2ebdedb220e479743797",
            "spotifyLink": "https://open.spotify.com/album/6PBZN8cbwkqm1ERj2BGXJ1",
            "appleLink": "https://music.apple.com/ca/album/good-kid-m-a-a-d-city/1471278069",
            "rating": 5,
            "date": "2021-08-26"
        },
        {
            "album": "To Pimp A Butterfly",
            "artist": "Kendrick Lamar",
            "review": "This album is incredible. Kendrick Lamar, coming off his previous album good kid m.A.A.d city, has probably some of the highest expectations of all time put on him. He just got done making one of the greatest rap albums and now he’s releasing a new project. Somehow, he does it, with To Pimp A Butterfly, he reaches expectations. In fact, to me, he surpassed them. Somehow, he followed up what would have been any other artists magnum opus with an instant classic that’s even better.<br />For this album Kendrick focuses on a different kind of story. He tells the story of his success, the survivor’s guilt he feels having made it out, and returning back to the life he’s left behind. The way he tells this story is perfect. Throughout the album we hear Kendrick reciting a poem, as the album goes on, he tells us more and more of the poem. Every time he stops on a line, the next couple songs focus on whatever he’s talking about in that line. It all culminates in the final song where he finishes the poem and talks about a lot, including social issues and the meaning of the title of the album. I won’t talk too much about the end since I think it’s a great ending and I wouldn’t want to spoil it for anyone who hasn’t heard the album all the way through.<br />The music on this album is probably a little more mature than previous Kendrick projects, the production is perfect all the way through the album and the beats are incredible. The music style here takes a lot of inspiration from many different historically African American genres of music including funk, jazz, and soul. The samples and beats come together to make an album that’s funky, jazzy and just some incredible-sounding and unique rap music. On top of the beats, Kendrick is in top form. His lyrics are powerful and meaningful. Many of the songs on the album can call for stopping the music and just really thinking about what the song was about and what was said. If you really wanted to, or were dedicated, you could probably write entire essays dissecting each and every song and the meaning behind the lyrics of each, that’s how rich they are in meaning. Not only are the words potent, but the flow Kendrick uses is always amazing. He changes up the flow often, that’s a bit of a Kendrick trademark, but all of them sound great. It sounds like Kendrick is flowing along the beat like he was made to do so, and it adds so much to how funky and enjoyable the songs on the album are.<br />Choosing a couple of favorite songs on this album is really hard to do, all of the songs are so damn good it honestly feels a little criminal to exclude some of them from my favorites. However, I have to try, and I guess a few do jump out as especially enjoyable for me. Those would have to be King Kunta, The Blacker The Berry, and Institutionalized. King Kunta is probably one of the funkiest tracks on the whole album. The beat is infectious and incredibly well-produced, and Kendrick’s rapping in top form. He talks about being at the top of his game and making it in the rap game. This celebratory anthem just comes together to sound incredible and it’s impossible not to nod your head with the beat and sing along once you know the lyrics. The Blacker The Berry is a lot more heavy and hard-hitting than King Kunta but it’s still just as good. On this song, you can hear the anger and frustration in Kendricks voice as he talks about the struggles black people in America face. He tells of the hatred he and many others like him face every verse he says he is a hypocrite but doesn’t elaborate. In the final line of the song, he finally explains why he’s a hypocrite and this leaves the listener reeling, forced to reflect on the entire song with the new lens Kendrick provides with these lines. It comes together to make a powerful song and a very good sounding one, with one of my favorite choruses on the entire project. Finally, Institutionalized is a slow, jazzy song with a great meaning behind it as well. This song talks about how Kendrick is institutionalized by the life of the streets and the past he tried leaving behind but can’t. The chorus for this song is a meaningful one sung by Bilal and followed by a great bridge done by Snoop Dogg. It comes together to make one of the slower songs on the album, but still one that’s easy to jam out to and can really get you thinking with it’s lyrical content.<br />Overall, To Pimp A Butterfly is probably what I think is the best rap album ever, maybe even the best album ever. The album is meaningful, over an hour-long commentary on black people in America and their struggles. At the same time, it’s some of the greatest music to come out of the rap genre. A funky and soul-filled collection of songs that all hit super hard. If you’ve never heard this album, listen to it, and take the time to really listen to what is being said on each track. You won’t be disappointed, and you might find a new favorite album. This is the easiest 5 out of 5 I could ever give, and it should probably be higher.",
            "image": "https://i.scdn.co/image/ab67616d0000b273cdb645498cd3d8a2db4d05e1",
            "spotifyLink": "https://open.spotify.com/album/7ycBtnsMtyVbbwTfJwRjSP",
            "appleLink": "https://music.apple.com/ca/album/to-pimp-a-butterfly/1440828886",
            "rating": 5,
            "date": "2021-08-27"
        },
        {
            "album": "SUPER SLIMEY",
            "artist": "Future & Young Thug",
            "review": "For SUPER SLIMEY, Future and Young Thug come together to create a joint project. Two veterans and greats of the trap subgenre in rap coming together should be a pretty huge deal and promise a great record. However, on SUPER SLIMEY both seem to miss the heights they’re usually known for bringing and miss the mark just a little in my opinion. I think the record is just pretty generic and simple when these are the artists most well known for tracks like Codeine Crazy or Family Don’t Matter, which are both far from generic and simple.<br />I don’t think this album is without its hits, there are songs I actually like listening to and go into my playlist, but I think these songs are probably best enjoyed when shuffled into a playlist instead of listening to them back-to-back in the album. The songs are all pretty similar sounding, and this leaves for a listening experience where the songs just kind of blur and for me, I tend to lose interest as the album goes on. The album is also seriously lacking in hits. Typically, albums from either of these two have a headlining track that stands out and hits hard and overall is unique and well-made. When lacking in this headline track, it makes listening to the full album even harder with no good songs to highlight the experience. It seriously seems to me like the album is a collection of reject songs from a studio session, because I refuse to believe these two spent extensive studio time together and couldn’t come up with something that causes waves and evolves into a hit track.<br />Songs I like on the album are Drip On Me and Group Home. A couple of the other songs on the album are definitely playlist-worthy but these are the two I enjoy the most. For Drip On Me I just really like the chorus and that’s the main reason I listen to it. I don’t think the beat or verses are that special, but it’s at least good enough that the song definitely doesn’t get boring. It makes for a song that I think makes a good edition to a trap-focused playlist and is an enjoyable listen. As for Group Home this is another song that I love the chorus on. In fact, a funny story about this song is that the chorus was stuck in my head, and I had to listen to every song on the album because I couldn’t remember which one had the chorus. I guess that emphasizes my point on how the album kind of blurs together. Now, with that story done, back to the song. This song is actually, at least in my opinion better than Drip On Me. I actually think the beat is pretty well done, definitely not anything special, but pretty good. Future and Young Thugs flow are still not anything especially new but it switches up through the song enough for it to be an actual good listen. It makes Group Home definitely my favorite song on the album.<br />The songs I don’t like on the album would have to be Three and Feed Me Dope. Probably the main issue I have with Three is this weird sounding effect they put on the voices. I think it’s intentional, but it may not be. It sounds kind of like their voices are clipping, like they’re yelling into a terrible mic and it’s peaking. I don’t know why in the world they would ever do that on purpose but it sounds so bad. It makes me feel like I’m in a Call of Duty lobby and someone is blasting their music into the garbage mic they have. It actually completely ruins the experience of the song. As for Feed Me Dope, it’s just boring. Future is by himself on this song, which means the flow is going to be pretty stagnant throughout the song, already a bad omen. Then the beat comes in, and it quite literally never changes. The same beat from halfway through the first chorus, all the way to the end of the song. It doesn’t change pitch, it doesn’t remove some bass, it stays exactly the same the entire time. I’m pretty sure I’ve seen Kenny Beats make a better beat on YouTube in about 15 mins. By the end of the song, I need to wake myself up for the next track on the album.<br />Overall, this doesn’t hold up terribly well as an album. If you had each of these songs, randomly come up in a playlist, you probably wouldn’t think the album is too bad. The problem is when you listen to them all in a row, it just isn’t a very good experience. There isn’t enough variety or experimenting on the album to make it an interesting 40 mins. Instead, it feels like just one 40-minute-long song that’s repetitive and a little boring. That being said, I can admit it has its good tracks, once you’ve found the ones you like and add them to your playlist though, the album is just not worth listening to. I don’t really recommend this album at all; I think there are much better albums from both artists and you’re better off listening to those. This is a 2 out of 5 for me.",
            "image": "https://i.scdn.co/image/ab67616d0000b2735998097d9467eccb3e99b8c1",
            "spotifyLink": "https://open.spotify.com/album/187UNqZ7MX3neMYkkevmdm",
            "appleLink": "https://music.apple.com/us/album/super-slimey/1298483081",
            "rating": 2,
            "date": "2021-08-28"
        },
        {
            "album": "DAMN.",
            "artist": "Kendrick Lamar",
            "review": "For his 5th (or 4th if you don’t count Untitled Unmastered) studio album Kendrick Lamar comes with a sound that’s at least a little bit more mainstream than his previous works. Songs like HUMBLE and DNA are pretty modern and mainstream sounding songs and both got the mainstream attention probably because of that. That isn’t to say it sounds bad though, mainstream isn’t a negative descriptive term, it’s just one that describes the music well. I think his performance on this record is great and actually pretty up to standards for the incredibly high standards that come with Kendrick.<br />This album is also a bit of a departure from his past records as it’s very personal and focused on Kendrick in particular. His past couple projects are more focused on general struggles and stories of black people in either the hood or in America. Here, Kendrick comes a little more honest and real with the music. He doesn’t preach about these issues he talked about before. Instead, he laments on his own personal struggles and comes clean about his real, and sometimes dark, thoughts. One prevailing theme is this idea of no one praying for Kendrick. From what I understand, I think this is Kendrick loathing the position he’s kind of gotten in the rap game. People see him like a preacher who talks about the struggles of black people and sort of gives his prayers. The thing is, he’s not a preacher, he struggles with these things as well, he suffers in his life like everyone else. The difference is everyone else has Kendrick to pray for them, but Kendrick doesn’t have someone to do that for him. I think a song that really encompasses this idea is XXX. On this song Kendrick is being talked to by someone who just lost their child to violence and this person asks Kendrick to help him. He feels like Kendrick is a good person and a good example who can help him in this trying time. Kendrick isn’t having any of it though, he’s not special and he breaks explaining how if someone killed Kendricks child, then someone was getting killed. Kendricks previous music suggests that he’s this angelic forgiving figure who advocates only for peace and love, but that’s just an ideal, it’s not Kendrick. Here we see the real Kendrick, who’s passionate and angry and sometimes a little bit rash. He also seems to talk a lot about his shortcomings, sins, and how he’s trying to work on it with songs given deadly sins as titles and always immediately followed by a track with the corresponding heavenly attribute as its title, like LUST then LOVE.<br />Songs I really like on this track are XXX, which I talked about earlier, FEAR, and DUCKWORTH. FEAR has Kendrick coming raw and talking about a sensitive topic, his fears. Each verse has a 10-year difference between them where Kendrick is 7, 17, and 27, then the 4th verse is dedicated to talking about his fears. In the first verse Kendricks mother is talking about beating his ass and trying to discipline him into being a good kid. In the second verse Kendrick is a very pessimistic teenager talking about how he’ll probably die because that’s the only future he can see for himself. The third is Kendrick, 27 years old, and reeling from his success, not believing it and reflecting on it and his future from there. Finally, his last verse, he talks about all his fears. Interestingly he mentions the titles of a couple tracks on the album such as PRIDE, HUMBLE, and LOYALTY, suggesting these names are a lot more to him than just the titles he chose for the songs. The song is a very honest and raw look into Kendricks weakness and worries as someone who’s at the top of his career and super successful. DUCKWORTH is probably my favorite song on the album. This song has a great soul sample playing throughout the song. The beat is funky and banging. All this is great, but what truly makes this song my favorite is the lyrical content. On this track, Kendrick tells a story about Anthony, and his plan to rob a KFC where someone named Ducky works. As the track goes on, Ducky gets on Anthony’s good side, and he doesn’t rob the place. This means that Ducky never gets stuck up at the KFC and doesn’t risk being killed. At the end of the song Kendrick makes a revelation about these two characters, I won’t say what it is for spoilers’ sake, but it makes the entire song take on so much more meaning and it’s an incredible bit of storytelling on a great song.<br />There aren’t really any songs I don’t like on the album. However, I will say I think the song YAH is a little weaker than the rest. I think it is a bit slow for me and also kind of monotonous especially for a Kendrick song, where he can sometimes use a different flow for every verse he spits. I don’t think it’s a bad song, just definitely not a highlight to me. The only other track I want to mention is LUST. I actually really love LUST, but there’s a serious problem that always bothers me whenever I listen to it. About halfway through the song, a snare is introduced to the beat, and it is so damn loud. Most of the time when I listen to this song, I need to turn down the volume a bit just because of this one snare that’s just way too loud. It’s really annoying but it never stops me from listening to it because it is a really good song.<br />Overall, I think this is a great show of skill from Kendrick Lamar, and it’s a wonderful album. I don’t think DAMN. surpasses either good kid, m.A.A.d city or To Pimp A Butterfly for me, but it’s still a really great record. If Kendrick only made records with quality like this from now on, I wouldn’t be disappointed, in fact I’d be pleasantly surprised and ecstatic. When I say this isn’t as good as his previous albums, that isn’t saying it’s bad or even saying it’s not great, his previous records are just so good an album can be worse than them and still be almost perfect. DAMN. is a 5 out of 5 for me and if you’ve never heard it before, you should listen to it for sure.",
            "image": "https://i.scdn.co/image/ab67616d0000b2738b52c6b9bc4e43d873869699",
            "spotifyLink": "https://open.spotify.com/album/4eLPsYPBmXABThSJ821sqY",
            "appleLink": "https://music.apple.com/us/album/damn/1440881047",
            "rating": 5,
            "date": "2021-08-28"
        },
        {
            "album": "untitled unmastered.",
            "artist": "Kendrick Lamar",
            "review": "I don’t really know if this counts as an album, it’s literally just a collection of tracks that I guess didn’t make it onto To Pimp A Butterfly. However, I guess the specifics aren’t exactly important, Kendrick released it as a collection so might as well treat it like an album. The album is described pretty well by its title, a collection of untitled and unmastered songs. I can say for sure that the songs are definitely untitled, as for unmastered though I’m not too sure. Most of the songs sound good enough to be full releases on a regular album, with the exception of one part of untitled 07. I suppose maybe if they were released normally, more work would go into the songs.<br />With this being said, don’t let the title or the untitled songs turn you away from this project. As I said earlier, most of the songs here sound great, like a song you’d here on any regular album. I will say, however, I’m not a fan of releasing projects with unnamed songs. A title, to me, is so important in how a track is remembered and is also necessary in ensuring each comes off as unique. Like, here, every track is actually pretty different sounding, but I can’t remember which is which until I actually play the songs because there aren’t any titles, just numbers for each song. A title is how a track is remembered by me, having untitled tracks is just not something I like. It definitely hurts, not my experience listening to the album, but my ability to remember exactly what the album sounds like before listening again.<br />The sound of this record is very reminiscent of To Pimp A Butterfly. Each track has a date and from the date, I think these songs were made in the To Pimp A Butterfly era and I guess never made it on the album and were released here instead. So, as a fan of To Pimp A Butterfly, this collection of songs is pretty damn enjoyable.<br />My favorite songs on the album are untitled 02 and untitled 08. untitled 02 is a great song, it sounds entirely finished and has some nice Kendrick flow over top of it. It’s a bit of a slower song for the first half but is a great vibe. At the halfway point Kendrick switches his flow and the song becomes much more hard hitting and lyrical heavy. It comes together to make a highlight track on the album for sure. As for untitled 08, this song is a nice funky jam. I think this is probably my favorite song on the entire album. It reminds me so much of those highlight moments on To Pimp A Butterfly with those funky beats that Kendrick just absolutely kills. This song makes the whole album, and the fact it’s the last song just leaves me off on a super high note off the short album runtime.<br />My least favorite songs are probably untitled 04 and untitled 07. I don’t think either of these tracks are even that bad, especially untitled 07, which actually has some serious highlights through its 8min runtime, it just also has a couple low lights as well. Let’s start with untitled 04, this is a strange track in my opinion. It’s kind of like an interlude that SZA does, it’s only 1:50 long and Kendrick doesn’t really rap on it at all. This is weird to me only because this whole album is just untitled unmastered tracks, why put an interlude-like song in here? It just isn’t something I understand very well. As for untitled 07, like I said earlier, half this song is actually really good, there’s even a bit of a running title for it as “levitate”. My issue is the second half. A 4-minute outro or alternate part of the song, and it kind of just leaves a bad taste in my mouth. The whole thing is probably the only part of the album I’d call unfinished. It’s just Kendrick talking to, I assume, friends about this idea he has for a track and it’s like a raw studio session. Now obviously it’s an unmastered album, this should be expected, but why is this the only part of the album like this. Also, why does this part have to be at the end of a completely different track, it kind of just ruins a great track when it could have been a different song if it had to be in the album. Either way, I just don’t like that second half at all.<br />Overall, this a pretty good album. It’s definitely not up to most of Kendrick’s other works, but that’s to be expected, it’s hard to even call this a full album, it’s more like a collection of missing tracks that was compiled together. Obviously, it won’t reach the heights of storytelling masterpieces like good kid, m.A.A.d city or To Pimp A Butterfly. This gets a 4 out of 5 for me. If you’ve listened to To Pimp A Butterfly and liked it, this album is just like some extra cuts from that album so you should listen to it. If not, definitely listen to To Pimp A Butterfly before trying this one, then you can decide whether to listen to this one from there.",
            "image": "https://i.scdn.co/image/ab67616d0000b2738c697f553a46006a5d8886b2",
            "spotifyLink": "https://open.spotify.com/album/0kL3TYRsSXnu0iJvFO3rud",
            "appleLink": "https://music.apple.com/us/album/untitled-unmastered/1440844834",
            "rating": 4,
            "date": "2021-08-29"
        },
        {
            "album": "DAYTONA",
            "artist": "Pusha T",
            "review": "One of the five albums released as part of the GOOD Music 2018 summer run, DAYTONA is probably the best of the bunch. Clocking it at only 21 mins over 7 songs, it’s also one of the shortest of the bunch. This brevity doesn’t lower the quality though, if anything it probably heightens it. It really feels like Pusha T took the quality you’d find sprinkled throughout an hour long album and compressed it into the 21 minute runtime, leaving each verse hard-hitting and incredible sounding. The production on this project, done at least partly by Kanye West, is insane with incredible beats perfect for complimenting Pusha’s delivery and flow over each track.<br />DAYTONA is seriously a great album at showcasing how important quality is over quantity. As albums seem to get longer and longer, with artists basically just putting out as much music as possible looking for a hit, Pusha seems to do the opposite. After a 3-year drought from his previous album he releases 21 mins worth of music, but he makes sure every second of that 21 mins is some top-quality performances from him. Sure, the album might leave you wanting more Pusha, but the beauty of it is that the music is so good you can just restart the album and enjoy it all the same.<br />My favorite songs on this album are all of them. They’re all great songs. If I had to choose only a couple to highlight, I guess If You Know You Know and Come Back Baby. If You Know You Know has what is almost definitely my favorite beat on the whole project, with an amazing sample that runs throughout the whole song. As an intro, Pusha does a great job setting the tone of the project with hard-hitting lines and verses referencing drug dealing, the streets, and the life he lives. The chorus is amazing, just as hard-hitting as the verses but with just the right amount of infectious sound so you can enjoy singing along with Pusha. As for Come Back Baby, this is another track with an incredible sample that is used as the chorus for the song. The sample has a beautiful soul sound and is interrupted with the grimy sounding raps of Pusha and the bass-filled beat behind the rapping. It’s a song with two beautifully contrasting sounds that come together to make a song that’s both so beautiful and at the same time gritty and hard.<br />There are quite honestly no songs I think are bad on this album, so instead I’ll talk about the two tracks that got a little controversial at the time of release. First is What Would Meek Do? This got a little controversy because of Kanye’s verse and who he was at the time. He mentions the poopity scoop song he made at the time, which I think is typical funny Kanye stuff. He also seems to mention the MAGA hat and Trump controversies happening at the time. I don’t think Kanye was in a good headspace at the time, so I can find it in myself to forgive him but his “being controversial for the sake of being controversial” attitude isn’t very good, and it definitely makes his lines on this song a little weird to listen to especially as time goes on. The other song that got some controversy was Infrared, an apparent Drake diss. I think Infrared is a good song, but music beef is not my beef. I don’t really care what rappers think about each other, I’ll listen to Infrared then some Drake, it’s never that deep. That being said that beef was pretty fun to watch at the time, so I guess some good came out of it.<br />Overall, I love DAYTONA. This album has track after track that goes super hard. It feels like Pusha T is at the top of his game for the full 21 mins of runtime and it makes for an amazing listening experience. If you’ve never heard DAYTONA, I recommend trying it out, it’s only 21 mins so it won’t take much of your time and if you’re a rap fan I’m sure you’ll find something to love about this album. An easy 5 out of 5 for me.",
            "image": "https://i.scdn.co/image/ab67616d0000b273263555eebbe2b375593aa31e",
            "spotifyLink": "https://open.spotify.com/album/07bIdDDe3I3hhWpxU6tuBp",
            "appleLink": "https://music.apple.com/us/album/daytona/1388853738",
            "rating": 5,
            "date": "2021-08-30"
        }
    ]
}