{
    "data": [
        {
            "album": "My Beautiful Dark Twisted Fantasy",
            "artist": "Kanye West",
            "review": "My Beautiful Dark Twisted Fantasy is a lot of things: Kanye West’s magnum opus, a work of art, and maybe even one of the greatest rap albums of all time. However, there is one thing it most definitely is not and that is bad.<br />The year is 2009 and Kanye West, after making a fool of himself at the VMA’s and gaining the hatred of what seems like the entire world, locks himself up in a studio in Hawaii and assembles a team. There he works long hard hours, knowing his next project is probably the only thing that could ever redeem him in the eyes of the public. From the fruit of that labor comes My Beautiful Dark Twisted Fantasy, a masterpiece of music – 1 hour 8 mins of what is probably some of the best rap music that will ever be made.<br />This project is probably as close to perfect a piece of art can get. Song after song of incredible music. Bars on top of bars over production that’s so well done it is honestly mind blowing that anyone can make something that well-crafted.<br />This album is Kanye West, the arrogant full-of-himself asshole, being vulnerable and talking about him, his thoughts, and what he’s going through. Take for example Runaway, one of the best rap songs ever made, has Kanye admitting his faults and that outro with him speaking unintelligibly with heavily distorted autotune vocals you can’t hear a word he’s saying but the emotion in his words is raw and it’s real and you can feel it in the music.<br />As for songs I like, basically all of them. Seriously, the run of songs from Dark Fantasy to Runaway is some of the best songs all back to back to back it’s insane how good it is. It’s probably easier to talk about which songs I’m not a big fan of those being only Hell Of A Life and Blame Game, the latter only because of the 2 and a half minute skit at the end of the song, which runs for way too long. That being said these songs aren’t my favorite <em>on the album</em>, they’re still very good just not as good when being compared to the near-perfect songs on this album.<br />Overall, this album is incredible, a work of art that literally everyone should listen to. Even if you’re not a fan of rap or you think Kanye West is a bad person and you don’t like him. Listen to this album, hear it not for the person who made and his endless controversies, but for the art it represents and the countless hours of musical genius that went into creating one of the best pieces of music of this generation. Needless to say, 5 out of 5, if I could give it more I would.",
            "image": "https://i.scdn.co/image/ab67616d0000b273d9194aa18fa4c9362b47464f",
            "spotifyLink": "https://open.spotify.com/album/20r762YmB5HeofjMCiPMLv",
            "appleLink": "https://music.apple.com/us/album/my-beautiful-dark-twisted-fantasy/1440742903",
            "rating": 5,
            "date": "2021-08-22"
        },
        {
            "album": "KIDS SEE GHOSTS",
            "artist": "KIDS SEE GHOSTS",
            "review": "The dynamic duo of Kanye West and Kid Cudi come together to bring us an entire project and they definitely do not disappoint.<br />KIDS SEE GHOSTS has two greats of our generation coming together and they seem to jump on each track just to flex their combined creative genius. Seven tracks, some a little experimental, but all very great and easy to listen to. These tracks come together to make a pretty short album, but one that’s easy to get into as well as one that keeps you engaged and never disappoints.<br />I distinctly remember my first time listening to the project together with my friends in high school together in one of their cars and the whole thing was incredible front to back. It’s stayed with me for years now and still I can listen to the whole thing, sing it almost all word for word, and enjoy every second of it.<br />Highlight songs for me include the title track Kids See Ghosts, Feel The Love, and Cudi Montage all great songs that always have a spot in my playlist. Only one song doesn’t really do it as good for me as the rest and that’s Freeee, I don’t think it’s a bad song but it’s definitely not as good as Ghost Town (the song it’s supposed to be a sequel of) or as other tracks on the album.<br />Overall, needless to say, this gets a full 5 stars, the only complaint I can even come up with for the album is that it should’ve been longer. With a runtime of only around 24 min it leaves you wanting more and hopefully we can see some more in the near future. If you’ve never heard KIDS SEE GHOSTS I definitely recommend you check it out, I’m positive you won’t be disappointed, especially if you’re a Kanye or Cudi fan.",
            "image": "https://i.scdn.co/image/ab67616d0000b273013c00ee367dd85396f79c82",
            "spotifyLink": "https://open.spotify.com/album/6pwuKxMUkNg673KETsXPUV",
            "appleLink": "https://music.apple.com/us/album/kids-see-ghosts/1396710872",
            "rating": 5,
            "date": "2021-08-22"
        },
        {
            "album": "JEFFERY",
            "artist": "Young Thug",
            "review": "As an artist Young Thug is pretty interesting, I wouldn’t call his music the highest of art, but at the same time it doesn’t really feel like that’s what he’s going for. Listening to the music it feels like Young Thug gets behind the mic and just has a good time with it, and for me that makes listening to his music a good time as well.<br />JEFFERY is probably the first Young Thug project I ever listened to in full. The album or EP seems to be a 10-track ode to all of his inspirations. Each track is named after a different person who I assume are his inspirations, with the exception of Pick Up The Phone which seems to be an odd one out as well as Harambe who is most likely just there as a joke.<br />Overall the project is actually pretty well done. It’s definitely one of my favorite Young Thug projects to date. It’s full of the classic Young Thug bars, where they’re either completely unintelligible or so strange you question whether, and maybe hope, you misheard it. Either way if you wish to know what he’s talking about you’re going to need the genius page for each song. But the good part is that you don’t need the lyrics to enjoy the vibe and the music of each song. Young Thug’s voice is like an instrument, there just to enhance the listening experience, not there to provide commentary or insight into whatever topic he’s talking about.<br />The best songs on the album are definitely Wyclef Jean, which is probably my favorite Young Thug track ever, as well as Kanye West and Pick Up The Phone, which all go pretty hard in their own right. My least favorite is probably Floyd Mayweather, which in my opinion is a little too long and kind of a lot slower than all the other songs, it’s definitely a different vibe and I can’t say I’m all there for it.<br />In conclusion, the album is great, and I love it, I think it’s some top-level Young Thug and if you’re a fan of that kind of music you should definitely give this album a try. As for a rating, I’m going to go with a 4 out of 5, incredibly done and a great listen.",
            "image": "https://i.scdn.co/image/ab67616d0000b273d0c72291cd96834e199e1ff8",
            "spotifyLink": "https://open.spotify.com/album/7EpUpNUkkEGnaCvkcn1j4H",
            "appleLink": "https://music.apple.com/us/album/jeffery/1146718343",
            "rating": 4,
            "date": "2021-08-22"
        },
        {
            "album": "ye",
            "artist": "Kanye West",
            "review": "ye, the 8th studio album by Kanye West, is a short one, only clocking in at around 24mins but it’s also a pretty heavy one. This album sees Kanye in a rare fragile and honest place. This makes for music that’s probably a little more conscious and meaningful than his other work but still very much Kanye West music.<br />On this album we see Kanye opening up about a lot of things he’s never really talked about publicly, at least not in his music. He talks about suicide, problems in his marriage and getting through those problems (that didn’t age very well), as well as his bipolar disorder, and the dilemma he faces trying to raise a young daughter while being a huge part of a rap game that rarely shows respect to women. It makes for a project that at least seems like an honest look into the person who is Kanye West and his tumultuous mind.<br />With all that being said we still see some weird and questionable lyrics that honestly he probably shouldn’t have said. If we go back to 2018 when Kanye released this he was in a pretty weird place and it seems to jump out in some of the lyrics he chooses to say on the project. He references his very questionable take on slavery in Wouldn’t Leave and instead of trying to walk it back he seems to defend it which is at least a little weird. We also get some of the usual suspect lyrics that are pretty bad but actually kind of funny like the focus on two things at once line in All Mine. Overall lyrics aren’t too bad, they take you out of it at some points but honestly it comes with the territory, this is Kanye West we’re talking about.<br />As for songs on the album I think Ghost Town is by far the best, it’s a great song and if you’ve never heard it I think you should I really love it. As for songs I don’t really like for one I Thought About Killing You, I don’t really think this is a bad song but it’s a really weird one and it’s hard to get into it since it only really starts after 2 mins since the first 2 mins is Kanye talking about his suicidal thoughts and killing you. I also don’t really like Wouldn’t Leave very much, it’s super slow, has the weird lyrics I mentioned before and is just all around far from the best Kanye has to offer.<br />This album is an interesting one, it’s really short so it’s easy to listen to and isn’t much of a commitment but that also means it’s kind of lacking in content which makes the weak parts so much more impactful to the experience. For example since the album is only 24 mins, that 2 min intro for I Thought About Killing You is over 8% of the total runtime, that’s kind of crazy and it definitely takes a toll on the experience. I also find this project is kind of forgettable, sometimes I forget this album ever came out and I think that’s because of its short runtime as well as it’s just good, nothing more. Usually, Kanye projects are innovating or huge events or have the strangest album rollout possible but this is so average in comparison. It came out on time, it didn’t really completely miss expectations, and it didn’t do anything new.<br />Overall, I don’t think this album is bad, I think it’s actually pretty good but it’s just that, good. It doesn’t blow me away and it doesn’t really do anything exceptional it’s just a solid collection of songs. For that reason, it gets a 3 from me. As for whether I recommend, I think if you’re a fan of Kanye, definitely give it a listen, it’s still Kanye music and it’s not bad. If you’re not a fan of Kanye, just pick a different project to start out with, there are many better ones. That being said I think Ghost Town should be something everyone listens to regardless, seriously that song is great.",
            "image": "https://i.scdn.co/image/ab67616d0000b2730cd942c1a864afa4e92d04f2",
            "spotifyLink": "https://open.spotify.com/album/2Ek1q2haOnxVqhvVKqMvJe",
            "appleLink": "https://music.apple.com/us/album/ye/1441456689",
            "rating": 3,
            "date": "2021-08-22"
        },
        {
            "album": "The College Dropout",
            "artist": "Kanye West",
            "review": "Kanye West’s first album is a very strong introduction to the rap game. The album is absolutely packed with great song after great song. Each having Kanye’s infectious beats and the classic soul samples that everyone fell in love with. It comes together to make a wonderful album that’s enjoyable from beginning to end.<br />This album is actually pretty impressive, it’s incredibly good, especially for an artists first real project. It also comes together to tell a pretty funny and enjoyable story with funny skits spread throughout the album and a general theme through the songs. This theme obviously being school, specifically post-secondary education, as well as full-time jobs and Kanye’s general dislike for all of it. That being said, the theme is pretty sparse in the songs and isn’t even present in most of them so even if you can’t get behind the sentiment of the album there are plenty of songs on it that have nothing to do with that theme.<br />As for good songs on the album, there are the definite greats like All Falls Down and Jesus Walks, but I think most people can agree those are incredible, so I’ll focus on less-mentioned songs that I really like. Those being Spaceship and Never Let Me Down, both being excellent songs in my opinion. Never Let Me Down is amazing, it has a beautiful sample present through the entire song and a wonderful chorus. Each of the 3 rappers present come to deliver a great verse each and it all comes together to make a song that I feel is a testament to how great Kanye was in this era of his career. As for Spaceship, that’s more of a song I just love for the vibe. I think this song has more of the theme of the album present, but what really gets me is the infectious hook sung by Kanye with another great sample behind it.<br />In terms of songs I don’t like, there aren’t really many, I think all of the songs are pretty good. The only ones I can’t say really connect with me are Get Em High and Last Call. Get Em High just isn’t really the kind of song I vibe with so I have some trouble enjoying it much. As for Last Call, I don’t think it’s terrible but it’s pretty hard to enjoy, especially on multiple listens. The problem for me is that it’s 4 mins of a pretty cool song I guess but it’s followed by quite literally 8 full mins of Kanye just talking about how he got started in the music industry. Now don’t get me wrong it’s interesting to hear his story but only on the first listen, every time after that it’s just 8 mins of talking that you already heard before.<br />Overall, I think The College Dropout is wonderful, it’s a great album with so much going for it and it really makes me understand some of the fans who miss this Kanye era. It definitely was a great time in his career, and the music he made at this time was so good and also free from the controversy he seems to be constantly surrounded by nowadays. If you’ve never heard Kanye this is a great place to start and if you have heard Kanye but never listened to this album, then seriously get on it, it’s some of his best work. Five out of five stars for sure.",
            "image": "https://i.scdn.co/image/ab67616d0000b27325b055377757b3cdd6f26b78",
            "spotifyLink": "https://open.spotify.com/album/4Uv86qWpGTxf7fU7lG5X6F",
            "appleLink": "https://music.apple.com/us/album/the-college-dropout/1412872568",
            "rating": 5,
            "date": "2021-08-23"
        },
        {
            "album": "Late Registration",
            "artist": "Kanye West",
            "review": "The second album from Kanye West builds a bit on the first one with similar themes of school except with the addition of being broke and in college which is what most of the skits are based on. The skits are still just as funny and are spread through the album pretty nicely.<br />It’s hard not to compare Late Registration with The College Dropout and I have to say that I do think Late Registration is a little weaker but that’s most likely just my personal opinion. I find the jazz inspired samples and production just doesn’t hit as hard for me as the soul in The College Dropout. That isn’t to say Late Registration is bad, I think it’s quite good and it has its fair share of highs, I just feel it’s not as consistently high as the previous album. In particular I find the album has a pretty weak mid-section, I think from Skit #1 to Skit #2 there aren’t really many highlight songs unfortunately. I think it does pick up after that but that period definitely affects my enjoyment of the album.<br />As for songs I like, there are actually quite a bit, to start with are the givens like Gold Digger and Touch The Sky which I think everyone can agree are very good. Other than those, I really love Diamonds From Sierra Leone, either the remix or the original, I just really love the storytelling on this song. Also, that beat and the sample are incredible and it makes for such an amazing song to listen to. Another song I really love is Hey Mama, it’s an emotional tribute to Kanye’s mother and it’s beautiful. It really makes clear how important Kanye’s mother is to him and listening to it now hurts a bit knowing the unfortunate fate of Donda West.<br />In terms of songs I’m not a fan of, both Drive Slow and Crack Music aren’t really my type of song. I think both are not very fantastic, they don’t jump out at me as being special or unique songs on the album and I can’t vibe as well with these as I can with most of the other songs on the album. I also think both maybe have a little too much runtime and that probably adds to my distaste for them as they kind of just go on for too long.<br />Overall, I think Late Registration is a good album in Kanye’s discography, but it’s just a good album. I think a few other records in Kanye’s discography separate themselves from Late Registration and truly are greats. That being said, Late Registration is a great record and there are some serious gems in the track list, so if you’ve never heard it and you enjoy some of Kanye’s music definitely check it out, I’m sure you’ll find something to love about it. I’ll give this album a 4, a great project but not a perfect one.",
            "image": "https://i.scdn.co/image/ab67616d0000b273428d2255141c2119409a31b2",
            "spotifyLink": "https://open.spotify.com/album/5ll74bqtkcXlKE7wwkMq4g",
            "appleLink": "https://music.apple.com/us/album/late-registration/1440668749",
            "rating": 4,
            "date": "2021-08-23"
        },
        {
            "album": "Graduation",
            "artist": "Kanye West",
            "review": "To me Graduation feels like a celebration album that Kanye West made to celebrate the success of his first two projects. The direction seems to have gone in a much more celebratory and happy tone as the music is much more upbeat than previous records. I think I’ve either heard or read somewhere that the purpose of Graduation was to have a bunch of stadium songs Kanye could play at concerts to hype up the crowd. Either way, that’s exactly how the album comes across, a bunch of hype songs that would sound great at a party/club/concert.<br />Not only is the album pretty hype it’s also quite good. For a style of music Kanye’s never really done before Graduation is done impressively well. Most of the songs are bangers that are super enjoyable, with infectious beats. Probably best of all though, despite each song being made with a specific hype sound in mind, every song is different and unique enough that they each stand out in their own right. This makes listening to the album enjoyable and it doesn’t get repetitive or boring because every song is a generic hype track. They’re all hype but they’re each far from generic.<br />The first half of this album is actually incredible. From the incredible opener that is Good Morning, all the way to Can’t Tell Me Nothing is just great track after great track. Included in that group is Stronger, probably one of Kanye’s most popular songs of all time, and for good reason, that song is incredible and the daft punk feature/sample is so good. We also have I Wonder another favorite of mine as it’s just such a wonderful and infectious song that just always has me singing along. As for tracks outside of those 6, Homecoming is incredible. That song has such a great beat and the chorus sung by Chris Martin is so damn infectious I cannot help but sing along every time I hear it.<br />Now where the first half is super good, the second takes a severe dip in enjoyability for me. That isn’t to say it’s free of good songs, again as I said earlier Homecoming is incredible and most of the other songs are decent. The only two songs I really have a problem with are Barry Bonds and Drunk and Hot Girls. For some reason, both just really miss the mark for me, and I can’t enjoy it. It reaches the point where the two back-to-back almost ruin the high I get from the first 6 tracks. I think my main issue with Barry Bonds is how slow and off-theme it is. It feels like most of the other songs are made with hype in mind but for some reason Barry Bonds is this slow, chill track which just doesn’t fit in my opinion. I think Drunk and Hot Girls has a similar problem to Barry Bonds where it just kind of ruins the theme of the album so far and it’s so slow and chill whereas songs like Good Life and Can’t Tell Me Nothing are so hype in comparison. It makes for a terrible contrast that just takes me out of the album a bit and I can’t enjoy it.<br />Overall, I think this album is really good. For the most part, it sticks to it’s hype theme pretty closely and the tracks are all really well done, to the point where I can imagine most being great openers for a concert. It definitely has its problems and its weak parts but for me the strong parts are so strong that it makes up for the weak parts and some more. Like most other Kanye records, if you’re a Kanye fan check this out. If you’re not a Kanye fan, maybe try this if you’ve never heard it, it’s a unique vibe and there’s some seriously good tracks on the album. Graduation gets a 4 out of 5.",
            "image": "https://i.scdn.co/image/ab67616d0000b2739bbd79106e510d13a9a5ec33",
            "spotifyLink": "https://open.spotify.com/album/5fPglEDz9YEwRgbLRvhCZy",
            "appleLink": "https://music.apple.com/us/album/graduation/1451142304",
            "rating": 4,
            "date": "2021-08-23"
        },
        {
            "album": "808s & Heartbreak",
            "artist": "Kanye West",
            "review": "Kanye’s 4th studio album, 808s & Heartbreak is a very unique one. Described very well by its title, we see Kanye air out his hurt, pain, and heartbreak using autotune over well-produced beats dominated by heavy-hitting 808s. The album was made shortly after Kanye lost his mother Donda and broke up with his then fiancée. The hurt from these two terrible losses really comes out through the course of the album. It makes for a very emotional album with a unique sound, at least for the time, that is a great listen.<br />It’s hard to talk about 808s & Heartbreak without at least mentioning its influence in modern rap. With 808s & Heartbreak Kanye created a whole new subgenre of rap that would bring so much new talent to rap and inspire an entire generation. Even if we try to downplay the impact and say Kanye didn’t create it and instead T-Pain or Kid Cudi created it, it’s impossible not to acknowledge how much power and impact Kanye’s record had in popularizing the genre and inspiring so many. That being said I don’t want this review to be a history lesson of rap, the influence of 808s & Heartbreak is undeniable, but I don’t want my review to be only about its influence, I want it to be about the music.<br />The music on 808s & Heartbreak is great, there’s a reason why this album inspired an entire generation of new musicians. It’s definitely incredible music. Personally, I prefer the first half of the album as I think it has a lot more songs I like and the ones I’m not too much of a fan of aren’t too bad. The second half, I feel doesn’t have as many hard hits as the first and some of the songs I just don’t really like much.<br />My favorite songs on the project are Heartless, Welcome to Heartbreak, and Love Lockdown. I think Heartless is pretty self-explanatory, it’s an incredible song. I remember listening to it all the time as a kid on my mp3 player and it’s just such a good song. Welcome to Heartbreak is a great Kanye and Cudi collab which serves as a great opener to the project and has some great lyrics that really set the tone of the project and the subject matter of the music. Love Lockdown is just such a jammer. The chorus is so great, always having me singing along, and the beat never fails to get my head bouncing like I’m a bobblehead. It’s just so infectious and a wonderful listen.<br />My least favorite songs on the album would probably be Bad News and See You In My Nightmares. I just think these two songs aren’t as catchy or infectious as the better songs on the album. I also don’t exactly think they’re terrible, they just don’t reach the same level that the better songs on the album do, at least not for me. I’m also not really a fan of Pinocchio Story, I understand the sentiments of live performance pieces on albums but for the most part I’m not exactly a fan of them. My biggest problem is they take me out of the album a little as it feels kind of like I’m listening to a leaked version of a song or a YouTube clip. I also feel like it’s some wasted potential, Pinocchio Story sounds like a very emotionally charged and heavy song that would probably be a beautiful closer if it was just over a beat and recorded in a studio. Instead, the emotion is drowned out by the echo’s and screaming fans that come with a live performance.<br />Overall, I think 808s & Heartbreak is a great album and a beautiful part of Kanye’s story and his discography. Its influence is incredible and the modern music it inspired is some of my favorite music ever. That being said I only want to review based on the music so it will get a 4, if I took into account the influence it’s an easy 5, but I don’t want to do that. If you’ve never heard 808s & Heartbreak you should listen to it, if not for its great music, then definitely for its incredible influence on modern music.",
            "image": "https://i.scdn.co/image/ab67616d0000b273346d77e155d854735410ed18",
            "spotifyLink": "https://open.spotify.com/album/3WFTGIO6E3Xh4paEOBY9OU",
            "appleLink": "https://music.apple.com/us/album/808s-heartbreak/1441410287",
            "rating": 4,
            "date": "2021-08-23"
        },
        {
            "album": "Yeezus",
            "artist": "Kanye West",
            "review": "Yeezus is an industrial, gritty-sounding album that shows a much a side of Kanye with a much larger ego. The songs are rough with heavy hitting base and, in general a much grittier sound than much of his earlier songs. That isn’t to say he ditches his past music style, there are still plenty of samples and a lot of songs have parts where Kanye brings back the beautiful sounds he’s known for.<br />The lyrical content of the album is also very egotistical and grimy. He has an entire song talking about how he’s a god. As a stark contrast from his previous two albums, instead of introspection, sadness, and disappointment his lyrics are violent, seemingly filled with anger, talking about everything from relationships to his impact in the industry.<br />That being said, even though Yeezus is grimy, egotistic, and rough sounding, it’s a great album. It’s a lot more experimental sounding than his previous works and because of that, a lot harder to get into. The industrial music is a much different sound than most are used to, despite other musical acts doing it even before Yeezus, like Death Grips. However, once you do get into that sound of music, it’s hard not to love Yeezus and all the grimy sounding tracks that fill its track list.<br />I have quite a few songs I love on this album, however, for the sake of not writing too much, I’ll narrow it down to two for the review. Those two would have to be New Slaves and Hold My Liquor. New slaves has an incredible beat, with hard-hitting vocals over the entire thing, Kanye talks about life as a black man in America, and in particular his experience getting into the fashion industry. Then there’s the outro, a beautiful experience, with vocals by both Kanye and Frank Ocean, it leaves you floating as the song ends. As for Hold My Liquor, this is a song I love for both the beat as well as Kanye’s flow in the first half. I’ve also always loved the intro to this with the vocals over the beat without any bass. This also has a great guitar outro that is a great closer to an amazing song.<br />In terms of songs I don’t really like, it would have to be Guilt Trip and Send It Up. I don’t think either of these songs are really bad, I just don’t like them compared to all the better tracks on the album. Guilt Trip, I enjoy the chorus and the Kid Cudi bridge, but I’m not a fan of the verse. I also don’t really like the beat for the song. For Send It Up, I also have some issues with the beat, I don’t like it much, I think it’s pretty par for the course for the album, but most other songs have breaks where the violent beat of the song is broken up by a beautiful break somewhere and I think this contrast is an important part of enjoying the album. Something like On Sight which has a beautiful, almost hymn-like interlude halfway through the song, which breaks up arguably the most violent sounding beat on the entire project. I’d go as far to say On Sight is only good because of that interlude breaking up the song like it does. I think Send It Up would sound a lot better if it also had something that breaks up the violence of the beat.<br />Overall, this project is really solid and personally, I like it a lot. I think there is some room for improvement, and it could have been a better project, which is why I will give it a 4. I think this is probably not a good starting album if you want to listen to Kanye, not because it’s bad but because it’s so different. The project is violent, experimental, and industrial. It’s far from an introductory project so if you do want to listen to Kanye, I recommend starting somewhere else, and then you can come back to this project once you’re more versed in his catalog and maybe rap as a genre.",
            "image": "https://i.scdn.co/image/ab67616d0000b2731dacfbc31cc873d132958af9",
            "spotifyLink": "https://open.spotify.com/album/7D2NdGvBHIavgLhmcwhluK",
            "appleLink": "https://music.apple.com/us/album/yeezus/1440873068",
            "rating": 4,
            "date": "2021-08-24"
        },
        {
            "album": "The Life Pablo",
            "artist": "Kanye West",
            "review": "On release The Life of Pablo was a very different album than what it is now. Its rollout was a very strange one, on release the songs were okay but some were a bit unfinished and there was a whole song missing compared to what we have now. Since the album is in the state it is now my review will be focused on this most recent version and not the older ones that existed on release.<br />The Life of Pablo has a special place in my heart, it was one of the first Kanye albums I ever heard, and I’d say it’s one of the albums that got me into rap music as a genre. The album is great, a collection of wonderful tracks with lyrics that have Kanye celebrating his success in both music and fashion and production that is as good as is expected from Kanye. Kanye strokes his ego even more than usual with songs like Famous and Facts where he celebrates his fame and influence as well as his Yeezy brand. The album also has a couple funny and strange lines like the classic asshole one in Father Stretch My Hands Pt.1. They mostly pull laughs from me and don’t have me questioning why Kanye would ever say that so they don’t really hurt the experience much.<br />My favorite tracks on the album are honestly really hard to narrow down to a couple. I love so many of the tracks on this album and I come back to listen to certain ones all the time because they’re all just so memorable. If I had to pick one song on this album that is the absolute peak of Pablo for me, it would have to be Saint Pablo. Saint Pablo is the 20th track on the album and was added post-release. The song is incredible and ends off the album in such an amazing way. Kanye flow and rapping on this track is some of the best in a long time. He talks a lot about money, controversies, and a lot more personal topics. It’s a much more lyrically involved track then most of the other songs on the album and it has some great production with some incredible interludes and a great outro that always has me floating.<br />As for songs I’m not a fan of, it’s honestly hard to find one, I think every song has a little something and I can enjoy almost all of them every time I listen to the album. I think probably the weakest tracks on the album would have to be Low Lights and Pt. 2. Low Lights is basically an interlude with no vocals by Kanye on it at all. Also, it has a very simple introduction at least compared to most other Kanye songs. As for Pt. 2, don’t get me wrong, I actually really like this song and it’s never a skip on the album. The only reason I think it’s a little weak on the album is because it’s literally just a Panda remix. It kind of just makes me question why is this even on the album when it could be like a single or something. It’s not a bad song but its inclusion on the album is a little strange to me, I just assume Kanye got a little obsessed with the song and so forced onto the album even if it’s a bit strange.<br />Overall, I love this album so much, as I said earlier it has a special place on my heart. I think every song is enjoyable and there are no skips from beginning to end of the album. If you’ve never heard The Life Of Pablo, please listen to it. It’s some of Kanye’s best work in my opinion and it can’t be missed, especially if you’re a rap fan. This definitely gets a 5 from me.",
            "image": "https://i.scdn.co/image/ab67616d0000b2732a7db835b912dc5014bd37f4",
            "spotifyLink": "https://open.spotify.com/album/7gsWAHLeT0w7es6FofOXk1",
            "appleLink": "https://music.apple.com/us/album/the-life-of-pablo/1443063578",
            "rating": 5,
            "date": "2021-08-24"
        },
        {
            "album": "JESUS IS KING",
            "artist": "Kanye West",
            "review": "A lot of people have a lot of opinions about JESUS IS KING, and most of them aren’t very good. I guess I’ll start by saying I don’t think the album is bad, it’s pretty good, but it’s definitely not up to par with most Kanye projects. I was fortunate enough not to follow too closely with the Yandhi era of Kanye so I was never too disappointed with Yandhi becoming this album. That all being said, there’s definitely a theme throughout this album for me and that is that it feels just a little bit unfinished.<br />There are some great songs in this album, songs that feel complete and sound up to par with other Kanye songs. That being said, I can’t say the same for every track. Some of these tracks feel, to me, like they would have and probably should have been completely different if Kanye put a little more time behind making the album. As an example, I’ll use the song Follow God. Now, I think Follow God is good, it’s Kanye flexing some of his rap prowess and the beat is pretty banging. That being said, the song is not even 2 mins long. It feels like Kanye had an entire song, took out one single verse and then that became Follow God. When I hear this song, I like it, but also, I just wonder like “where is the rest of the song”. This isn’t specific to that one song either, songs like Every Hour and Jesus Is Lord would sound so much better if there was more song around them and it wasn’t just basically an interlude. Songs like Selah, and Everything We Need aren’t bad, but it feels like there’s a verse or an outro that definitely should be there, but it isn’t. Now I understand it’s very possible that Every Hour and Jesus Is Lord we’re meant to be these short interlude-like tracks but regardless I’ll stand by my opinion that I think it would sound better if there was more to them.<br />Now for songs I like, definitely On God and Use This Gospel. On God is a great track with some incredible production by Pierre Bourne. It’s got this great sound to it and Kanye really has some good rapping on this track. Every time I hear it, I’m drawn to singing along and I enjoy every second for sure. As for Use This Gospel, I genuinely think this is the best song on the album by far. Now if you care for the history of it this was a Yandhi song called Law of Attraction and I don’t think what it became is disappointing in any way. The beat is great, with the humming on top of some piano keys. Probably my favorite part of the song though is the Clipse parts. They come on and absolutely kill it with a great verse that adds so much to the song and is one of my favorite parts on the whole album.<br />As for songs I dislike, I mentioned earlier a lot of the songs I think should have had some more work done to them, but funny enough I don’t think those are the bad tracks on the album at all. They just feel unfinished, but the part that is finished is really good. Therefore, the songs I’ll say I wasn’t impressed with are Water and Hands On. For Water, there’s really just nothing impressive about it, the production is simple, especially for Kanye standards and I don’t really like Kanye’s flow on it either. The chorus and bridges aren’t too bad, but a song is more than just those parts and the verse just doesn’t do it for me at all. As for Hands On, it’s a lot of the same as with Water, the production is nothing to write home about and Kanye’s verse is also just not very good in my opinion. There’s also a super weird part near the end where I think Young Thug comes on and says like 5 unintelligible words. It literally sounds like what he said was a recording of a phone call with bad connection, it makes me think there’s a missing feature that would have been there given more time, which is obviously disappointing.<br />Overall, JESUS IS KING isn’t a terrible album, I enjoy listening to it and it’s pretty easy to get through especially since it’s only 27 mins and most of the songs are pretty good. I guess my biggest problem is that it’s so disappointing considering how unfinished it sounds and how much better it could have been if it was properly finished. For these reasons I don’t recommend listening to this unless you’re seriously a fan of either gospel music or rap or, preferably, both. This gets a 3 from me.",
            "image": "https://i.scdn.co/image/ab67616d0000b2731bb797bbfe2480650b6c2964",
            "spotifyLink": "https://open.spotify.com/album/0FgZKfoU2Br5sHOfvZKTI9",
            "appleLink": "https://music.apple.com/us/album/jesus-is-king/1484936940",
            "rating": 3,
            "date": "2021-08-24"
        }
    ]
}